tests/Feature/request-envelope.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:prod="http://test.x-road.fi/producer">
   <soapenv:Header>
      <xro:protocolVersion>4</xro:protocolVersion>
      <xro:id>67322f5c-8c74-4b12-bbcb-073618f30b1b</xro:id>
      <xro:service iden:objectType="SERVICE">
         <iden:xRoadInstance>NIIS-TEST</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>0245437-2</iden:memberCode>
         <iden:subsystemCode>TestService</iden:subsystemCode>
         <iden:serviceCode>testService</iden:serviceCode>
         <iden:serviceVersion>v1</iden:serviceVersion>
      </xro:service>
      <xro:client iden:objectType="SUBSYSTEM">
         <iden:xRoadInstance>NIIS-TEST</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>123456-7</iden:memberCode>
         <iden:subsystemCode>TestClient</iden:subsystemCode>
      </xro:client>
   </soapenv:Header>
   <soapenv:Body>
      <prod:testService>
         <request>
            <responseBodySize>5</responseBodySize>
            <responseAttachmentSize>0</responseAttachmentSize>
         </request>
      </prod:testService>
   </soapenv:Body>
</soapenv:Envelope>